#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-PojY1KeESCLEFtGi" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/d25738c8-5c8e-438d-a1e3-8de848f69644/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-PojY1KeESCLEFtGi

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 7s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-alert-prs-slack-webhook-url_FE138519 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-alert-prs-slack-webhook-url_FE138519" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3354AFF2 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3354AFF2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EBE245CC will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EBE245CC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-gh-token_2A73F8CA will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-gh-token_2A73F8CA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-maven-gpg-private-key-passphrase_4232A6CE will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-maven-gpg-private-key-passphrase_4232A6CE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-maven-gpg-private-key_6228FF61 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-maven-gpg-private-key_6228FF61" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-maven-password_560FE18E will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-maven-password_560FE18E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-maven-staging-profile-id_B61AEF1F will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-maven-staging-profile-id_B61AEF1F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-maven-username_589BD3DF will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-maven-username_589BD3DF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-npm-token_2FE1C3B3 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-npm-token_2FE1C3B3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-nuget-api-key_E49C1256 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-nuget-api-key_E49C1256" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-twine-password_B007A91B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-twine-password_B007A91B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-ad_repo_secret-twine-username_29CFF4D8 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-ad_repo_secret-twine-username_29CFF4D8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-alert-prs-slack-webhook-url_F284DD90 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-alert-prs-slack-webhook-url_F284DD90" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B7DC52B0 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B7DC52B0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9CAE1CBD will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9CAE1CBD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token_3E7EEAD7 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-gh-token_3E7EEAD7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-maven-gpg-private-key-passphrase_6DB00D79 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-maven-gpg-private-key-passphrase_6DB00D79" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-maven-gpg-private-key_D569CAE4 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-maven-gpg-private-key_D569CAE4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-maven-password_96664F2C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-maven-password_96664F2C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-maven-staging-profile-id_AF0E5FA5 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-maven-staging-profile-id_AF0E5FA5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-maven-username_005E6FCF will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-maven-username_005E6FCF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-npm-token_F3160023 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-npm-token_F3160023" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-nuget-api-key_B2B39915 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-nuget-api-key_B2B39915" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-twine-password_44BD41C3 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-twine-password_44BD41C3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-azurestack_repo_secret-twine-username_69235E64 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-azurestack_repo_secret-twine-username_69235E64" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_4428D35C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_4428D35C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5F225F57 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5F225F57" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5C177A94 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5C177A94" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-gh-token_43DB6CE1 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-gh-token_43DB6CE1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_542B906A will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_542B906A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-maven-gpg-private-key_4CA0D870 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-maven-gpg-private-key_4CA0D870" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-maven-password_61967D8D will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-maven-password_61967D8D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-maven-staging-profile-id_B9590D04 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-maven-staging-profile-id_B9590D04" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-maven-username_DBE1B1F0 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-maven-username_DBE1B1F0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-npm-token_E9A871DA will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-npm-token_E9A871DA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-nuget-api-key_76C3DE9F will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-nuget-api-key_76C3DE9F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-twine-password_3B91182C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-twine-password_3B91182C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-boundary_repo_secret-twine-username_CBC64674 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-boundary_repo_secret-twine-username_CBC64674" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-alert-prs-slack-webhook-url_39B87816 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-alert-prs-slack-webhook-url_39B87816" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_72B55CE1 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_72B55CE1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EEDE9D65 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EEDE9D65" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-gh-token_A11E549D will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-gh-token_A11E549D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-maven-gpg-private-key-passphrase_17B674EA will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-maven-gpg-private-key-passphrase_17B674EA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-maven-gpg-private-key_ED861D33 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-maven-gpg-private-key_ED861D33" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-maven-password_18DD502B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-maven-password_18DD502B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-maven-staging-profile-id_4121ACD2 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-maven-staging-profile-id_4121ACD2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-maven-username_201F4F9C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-maven-username_201F4F9C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-npm-token_D4CACB5B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-npm-token_D4CACB5B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-nuget-api-key_B43EE523 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-nuget-api-key_B43EE523" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-twine-password_231BFF24 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-twine-password_231BFF24" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-consul_repo_secret-twine-username_66166BAD will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-consul_repo_secret-twine-username_66166BAD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_D1B30246 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_D1B30246" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_6571AB6B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_6571AB6B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DD4BD17B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DD4BD17B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-gh-token_82B02E77 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-gh-token_82B02E77" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_90839D91 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_90839D91" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-maven-gpg-private-key_BF7DF2A3 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-maven-gpg-private-key_BF7DF2A3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-maven-password_358CDFFC will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-maven-password_358CDFFC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-maven-staging-profile-id_9B4DA9FE will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-maven-staging-profile-id_9B4DA9FE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-maven-username_2F83704E will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-maven-username_2F83704E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-npm-token_B03550A4 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-npm-token_B03550A4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-nuget-api-key_323F04D9 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-nuget-api-key_323F04D9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-twine-password_580BFF14 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-twine-password_580BFF14" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-dns_repo_secret-twine-username_4AB440C2 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-dns_repo_secret-twine-username_4AB440C2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-alert-prs-slack-webhook-url_9ACF83A1 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-alert-prs-slack-webhook-url_9ACF83A1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_415584D6 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_415584D6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C6E21041 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C6E21041" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token_23861E52 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-gh-token_23861E52" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key-passphrase_58DB4FB9 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key-passphrase_58DB4FB9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key_746102A9 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key_746102A9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-password_A63B9997 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-password_A63B9997" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-staging-profile-id_7082930A will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-staging-profile-id_7082930A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-username_1A4EA69B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-maven-username_1A4EA69B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-npm-token_225C717D will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-npm-token_225C717D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-nuget-api-key_B3757385 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-nuget-api-key_B3757385" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-twine-password_1F2DDF9C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-twine-password_1F2DDF9C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-googleworkspace_repo_secret-twine-username_A89966CE will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-googleworkspace_repo_secret-twine-username_A89966CE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-alert-prs-slack-webhook-url_998E85B4 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-alert-prs-slack-webhook-url_998E85B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FA3DC648 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FA3DC648" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C3A56756 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C3A56756" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-gh-token_902DBC03 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-gh-token_902DBC03" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-maven-gpg-private-key-passphrase_0439979F will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-maven-gpg-private-key-passphrase_0439979F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-maven-gpg-private-key_8B15EE63 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-maven-gpg-private-key_8B15EE63" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-maven-password_4ADFD29C will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-maven-password_4ADFD29C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-maven-staging-profile-id_5E17B57B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-maven-staging-profile-id_5E17B57B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-maven-username_95E557B3 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-maven-username_95E557B3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-npm-token_29427564 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-npm-token_29427564" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-nuget-api-key_98148FA8 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-nuget-api-key_98148FA8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-twine-password_2E440572 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-twine-password_2E440572" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcp_repo_secret-twine-username_C327C648 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcp_repo_secret-twine-username_C327C648" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-alert-prs-slack-webhook-url_CE1F2C55 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-alert-prs-slack-webhook-url_CE1F2C55" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_610643ED will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_610643ED" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_2655DC47 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_2655DC47" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-gh-token_8FB71206 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-gh-token_8FB71206" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-maven-gpg-private-key-passphrase_F0C54361 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-maven-gpg-private-key-passphrase_F0C54361" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-maven-gpg-private-key_52E4F853 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-maven-gpg-private-key_52E4F853" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-maven-password_1A39F7D7 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-maven-password_1A39F7D7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-maven-staging-profile-id_183C48AA will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-maven-staging-profile-id_183C48AA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-maven-username_79C987D7 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-maven-username_79C987D7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-npm-token_8D46C8CA will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-npm-token_8D46C8CA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-nuget-api-key_39BED486 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-nuget-api-key_39BED486" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-twine-password_B97FDFB5 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-twine-password_B97FDFB5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-hcs_repo_secret-twine-username_CF320507 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-hcs_repo_secret-twine-username_CF320507" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_E85C7C92 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_E85C7C92" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_4569F917 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_4569F917" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5F0C6294 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5F0C6294" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-gh-token_AE6B8D7D will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-gh-token_AE6B8D7D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_CE6139E9 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_CE6139E9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-maven-gpg-private-key_ACBB2270 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-maven-gpg-private-key_ACBB2270" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-maven-password_791FD15A will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-maven-password_791FD15A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-maven-staging-profile-id_F6275748 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-maven-staging-profile-id_F6275748" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-maven-username_F04DE010 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-maven-username_F04DE010" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-npm-token_E1F65B03 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-npm-token_E1F65B03" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-nuget-api-key_1BC1436E will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-nuget-api-key_1BC1436E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-twine-password_0971EFE2 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-twine-password_0971EFE2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-http_repo_secret-twine-username_127E0DF6 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-http_repo_secret-twine-username_127E0DF6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_5B364E9D will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_5B364E9D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D8BC45E4 will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D8BC45E4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C5BA3A9B will be created
  + resource "github_actions_secret" "repos-official-new_cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C5BA3A9B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos-official-new_cdktf-provider-nomad_repo_secret-gh-token_08...
```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*